In [1]:
from pylab import plt
plt.style.use('seaborn')
import matplotlib as mpl
mpl.rcParams['font.family']='serif'

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame([10,20,30,40],columns=['numbers'],index=['a','b','c','d'])

In [4]:
df

   numbers
a       10
b       20
c       30
d       40

In [5]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
df.columns

Index(['numbers'], dtype='object')

In [7]:
df.loc['b']

numbers    20
Name: b, dtype: int64

In [8]:
df.loc[['a','c']]

   numbers
a       10
c       30

In [9]:
df.loc[df.index[1:3]]

   numbers
b       20
c       30

In [10]:
df.loc[df.index[2:3]]

   numbers
c       30

In [11]:
df.sum()

numbers    100
dtype: int64

In [12]:
df.apply(lambda x:x**3)

   numbers
a     1000
b     8000
c    27000
d    64000

In [13]:
df

   numbers
a       10
b       20
c       30
d       40

In [14]:
df['floats']=(1.5,2.5,3.5,4.5)

In [15]:
df

   numbers  floats
a       10     1.5
b       20     2.5
c       30     3.5
d       40     4.5

In [16]:
df['floats']

a    1.5
b    2.5
c    3.5
d    4.5
Name: floats, dtype: float64

In [17]:
df['numbers']

a    10
b    20
c    30
d    40
Name: numbers, dtype: int64

In [18]:
df['names'] = pd.DataFrame(['Yves','Guido','Felix','Francesc'],index=['d','a','b','c'])

In [19]:
df

   numbers  floats     names
a       10     1.5     Guido
b       20     2.5     Felix
c       30     3.5  Francesc
d       40     4.5      Yves

In [20]:
df.append({'numbers':100,'floats':5.75,'names':'Henry'},ignore_index=True)

   numbers  floats     names
0       10    1.50     Guido
1       20    2.50     Felix
2       30    3.50  Francesc
3       40    4.50      Yves
4      100    5.75     Henry

In [21]:
df

   numbers  floats     names
a       10     1.5     Guido
b       20     2.5     Felix
c       30     3.5  Francesc
d       40     4.5      Yves

In [22]:
df=df.append(pd.DataFrame({'numbers':100,'floats':5.75,'names':'Henry'},index=['z']))

In [23]:
df

   numbers  floats     names
a       10    1.50     Guido
b       20    2.50     Felix
c       30    3.50  Francesc
d       40    4.50      Yves
z      100    5.75     Henry

In [24]:
df.join(pd.DataFrame([1,4,9,16,25],index=['a','b','c','d','z'],columns=['squares',]))

   numbers  floats     names  squares
a       10    1.50     Guido        1
b       20    2.50     Felix        4
c       30    3.50  Francesc        9
d       40    4.50      Yves       16
z      100    5.75     Henry       25

In [25]:
df.join(pd.DataFrame([1,4,9,16,25],index=['a','b','c','d','y'],columns=['squares',]))

   numbers  floats     names  squares
a       10    1.50     Guido      1.0
b       20    2.50     Felix      4.0
c       30    3.50  Francesc      9.0
d       40    4.50      Yves     16.0
z      100    5.75     Henry      NaN

In [26]:
df

   numbers  floats     names
a       10    1.50     Guido
b       20    2.50     Felix
c       30    3.50  Francesc
d       40    4.50      Yves
z      100    5.75     Henry

In [27]:
df=df.join(pd.DataFrame([1,4,9,16,25],index=['a','b','c','d','y'],columns=['squares',]))

In [28]:
df

   numbers  floats     names  squares
a       10    1.50     Guido      1.0
b       20    2.50     Felix      4.0
c       30    3.50  Francesc      9.0
d       40    4.50      Yves     16.0
z      100    5.75     Henry      NaN

In [29]:
df.join(pd.DataFrame([1,4,9,16,25],index=['a','b','c','d','y'],columns=['squares',]),how='outer')

ValueError: columns overlap but no suffix specified: Index(['squares'], dtype='object')

In [ ]:
df[['numbers','floats']].mean()

In [ ]:
df[['numbers','floats']].std()

In [ ]:
a=np.random.standard_normal((9,4))

In [ ]:
a

In [ ]:
a.round(6)

In [ ]:
df=pd.DataFrame(a)
df.columns=['No1','No2','No3','No4']
df

In [ ]:
df['No2'].iloc[2]

In [ ]:
dates=pd.date_range('2021-1-1',periods=9,freq='M')
df.index=dates

In [ ]:
df

In [ ]:
np.array(df).round(6)

In [ ]:
df['No2'].iloc[3]
dates=pd.date_range('2021-1-1',periods=9,freq='M')
df.index=dates
df
np.array(df).round(6)